app/views/home/stream.html.erb

<h2><a href="/posts/<%= @popular[0].post.id %>"><%= @popular[0].post.title %></a></h2>
<p><%= @popular[0].post.content.split[0..(50-1)].join(" ") +(@popular[0].post.content.split.size > 50 ? " ..." : "")  %></p>
---
SELECT posts.*, COUNT(agrees.id) AS count_agrees FROM "posts" LEFT OUTER JOIN agrees ON posts.id = agrees.post_id GROUP BY posts.id ORDER BY posts.created_at DESC, count_agrees DESC