app/controllers/agrees_controller.rb

  def create
    @agree = Agree.new(params[:agree])
    @agree.user = current_user
    @agree.post = Post.find(params[:post_id])

    if @agree.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY posts.created_at DESC LIMIT 1  [["id", "2"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
INSERT INTO "agrees" ("created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 04 Aug 2012 14:10:26 UTC +00:00], ["post_id", 3], ["updated_at", Sat, 04 Aug 2012 14:10:26 UTC +00:00], ["user_id", 3]]

  def destroy
    @agree = Agree.find(params[:id])
    @agree.destroy
---
SELECT "agrees".* FROM "agrees" WHERE "agrees"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "agrees" WHERE "agrees"."id" = ?  [["id", 2]]