app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])
    @comment.user = current_user
    @comment.post = Post.find(params[:post_id])

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY posts.created_at DESC LIMIT 1  [["id", "4"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
INSERT INTO "comments" ("comment", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "I love this site."], ["created_at", Sat, 04 Aug 2012 14:12:31 UTC +00:00], ["post_id", 3], ["updated_at", Sat, 04 Aug 2012 14:12:31 UTC +00:00], ["user_id", 3]]