app/controllers/feedback_controller.rb

  def index

		@user = current_user

		@comments = Comment.joins(:post).where(:posts => { :user_id => @user.id })
		@agrees = Agree.joins(:post).where(:posts => { :user_id => @user.id })
---
SELECT "comments".* FROM "comments" INNER JOIN "posts" ON "posts"."id" = "comments"."post_id" WHERE "posts"."user_id" = 3
SELECT "agrees".* FROM "agrees" INNER JOIN "posts" ON "posts"."id" = "agrees"."post_id" WHERE "posts"."user_id" = 3