app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY posts.created_at DESC
---
  def index
    @posts = Post.all

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY posts.created_at DESC LIMIT 1  [["id", "4"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2
SELECT "agrees".* FROM "agrees" WHERE "agrees"."post_id" = 2
SELECT COUNT(*) FROM "agrees" WHERE "agrees"."post_id" = 2
SELECT "agrees".* FROM "agrees" WHERE "agrees"."post_id" = 2 AND "agrees"."user_id" = 3 LIMIT 1
SELECT 1 AS one FROM "agrees" WHERE "agrees"."post_id" = 2 AND "agrees"."user_id" = 3 LIMIT 1
---
  def show
    @post = Post.find(params[:id])
    @comments = Comment.where(:post_id => @post.id)
    @agrees = Agree.where(:post_id => @post.id)
    @agree_count = @agrees.count
    if @agree_count == 1
    	@peoplev = "person agrees"
    else
    	@peoplev = "people agree"
    end
    @agreed = Agree.exists?(:post_id => @post.id, :user_id => current_user)

INSERT INTO "posts" ("content", "created_at", "source", "tags", "title", "topic", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(params[:post])
    @post.user = current_user
    respond_to do |format|
      if @post.save