app/controllers/relationships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
INSERT INTO "relationships" ("created_at", "followed_id", "follower_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 04 Aug 2012 14:51:16 UTC +00:00], ["followed_id", 3], ["follower_id", 3], ["updated_at", Sat, 04 Aug 2012 14:51:16 UTC +00:00]]
---
  def create
    @relationship = Relationship.new(params[:relationship])
    @relationship.follower = current_user
    @relationship.followed = User.find(params[:user_id])

    if @relationship.save

SELECT "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def destroy
    @relationship = Relationship.find(params[:id])
    @relationship.destroy