app/controllers/users_controller.rb

  def profile

	  @username = params[:id]
	  @user = User.find_by_username(@username) # get user information

	  @posts = Post.where(:user_id => @user.id) # get all the user's posts for the blog as well as activity stream
	  @comments = Comment.where(:user_id => @user.id) # get all the users comments for the activity stream
    @agrees = Agree.where(:user_id => @user.id) # get all the users agreements for the activity stream
	  @activities = (@posts + @comments + @agrees).sort_by(&:created_at) # combine user's activities and sort them for the stream
	  @activites = @activities.reverse!

		@following = Relationship.where(:follower_id => @user.id)
    @following_count = @following.count
		@followers = Relationship.where(:followed_id => @user.id)
    @followers_count = @followers.count

    @isfollowing = Relationship.exists?(:followed_id => @user.id, :follower_id => current_user)
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'wasdylan' LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 3 ORDER BY posts.created_at DESC
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = 3
SELECT "agrees".* FROM "agrees" WHERE "agrees"."user_id" = 3
SELECT COUNT(*) FROM "relationships" WHERE "relationships"."follower_id" = 3
SELECT "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = 3 AND "relationships"."follower_id" IS NULL LIMIT 1
SELECT COUNT(*) FROM "relationships" WHERE "relationships"."followed_id" = 3
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 4 ORDER BY posts.created_at DESC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT 1 AS one FROM "relationships" WHERE "relationships"."followed_id" = 3 AND "relationships"."follower_id" IS NULL LIMIT 1

	def show
		@id = params[:id]
		@user = User.find_by_id(@id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1